package archeage.models;

import java.util.HashMap;
import java.util.Map;

public class ScheduleBosses {
    private static Map<String, String[]> bossName;
    public static void main(String[] args) {

    }
    static{
        try {
            bossName = new HashMap<>();
            bossName.put("Monday".toUpperCase(), new String[]{"АГЛ 3:20", "АГЛ 7:20", "Кошка 10:00", "Марля утро", "Морф утро", "АГЛ 11:20", "АГЛ 15:20", "АГЛ 19:20", "Кракен 19:30", "Калидис 20:30", "Кошка 22:00", "Марля вечер", "Морф вечер", "АГЛ 23:20", "Авиара", "Калеиль"});
            bossName.put("Tuesday".toUpperCase(), new String[]{"АГЛ 3:20", "АГЛ 7:20", "Кошка 10:00", "Марля утро", "Морф утро", "АГЛ 11:20", "АГЛ 15:20", "АГЛ 19:20", "Ксанатос 19:30", "Калидис 20:30", "Анталлон 21:30", "Кошка 22:00", "Марля вечер", "Морф вечер", "АГЛ 23:20", "Авиара", "Калеиль"});
            bossName.put("Wednesday".toUpperCase(), new String[]{"АГЛ 3:20", "АГЛ 7:20", "Кошка 10:00", "Марля утро", "Морф утро", "АГЛ 11:20", "АГЛ 15:20", "АГЛ 19:20", "Кошка 22:00", "Марля вечер", "Морф вечер", "АГЛ 23:20",});
            bossName.put("Thursday".toUpperCase(), new String[]{"АГЛ 3:20", "АГЛ 7:20", "Кошка 10:00", "Марля утро", "Морф утро", "АГЛ 11:20", "АГЛ 15:20", "АГЛ 19:20", "Кракен 19:30", "Левиафан 20:30", "Кошка 22:00", "Марля вечер", "Морф вечер", "АГЛ 23:20", "Авиара", "Калеиль"});
            bossName.put("Friday".toUpperCase(), new String[]{"АГЛ 3:20", "АГЛ 7:20", "Кошка 10:00", "Марля утро", "Морф утро", "АГЛ 11:20", "АГЛ 15:20", "АГЛ 19:20", "Ксанатос 19:30", "Калидис 20:30", "Анталлон 21:30", "Кошка 22:00", "Марля вечер", "Морф вечер", "АГЛ 23:20", "Авиара", "Калеиль"});
            bossName.put("Saturday".toUpperCase(), new String[]{"АГЛ 3:20", "АГЛ 7:20", "Кошка 10:00", "Марля утро", "Морф утро", "АГЛ 11:20", "АГЛ 15:20", "АГЛ 19:20", "Кракен 19:30", "Калидис 20:30", "Кошка 22:00", "Марля вечер", "Морф вечер", "АГЛ 23:20", "Авиара", "Калеиль"});
            bossName.put("Sunday".toUpperCase(), new String[]{"АГЛ 3:20", "АГЛ 7:20", "Кошка 10:00", "Марля утро", "Морф утро", "АГЛ 11:20", "АГЛ 15:20", "Фесаникс 18:30", "АГЛ 19:20", "Ксанатос 19:30", "Анталлон 19:50", "Калидис 20:30", "Кошка 22:00", "Марля вечер", "Морф вечер", "АГЛ 23:20", "Авиара", "Калеиль"});
        } catch (Exception e) {
            e.printStackTrace();
        }
    }
    public static String[] getScheduleBosses(String day) {
        return bossName.get(day.toUpperCase());
    }
    public static Map<String, String[]> getScheduleAllBosses() {
        return bossName;
    }
}
